In [7]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [8]:
%sql postgresql://student:student@127.0.0.1/sparkifydb

'Connected: student@sparkifydb'

In [9]:
%sql SELECT * FROM songplays LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(2, None, None, datetime.datetime(9999, 12, 21, 16, 3, 16, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), 'paid      ', 954, 'Tampa-St. Petersburg-Clearwater, FL', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.78.2 (KHTML, like Gecko) Version/7.0.6 Safari/537.78.2"'),
 (3, None, None, datetime.datetime(9999, 12, 22, 1, 13, 16, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), 'paid      ', 984, 'Lake Havasu City-Kingman, AZ', '"Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.125 Safari/537.36"'),
 (4, None, None, datetime.datetime(9999, 12, 23, 19, 9, 56, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), 'paid      ', 984, 'Lake Havasu City-Kingman, AZ', '"Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.125 Safari/537.36"'),
 (5, None, None, datetime.datetime(9999, 12, 24, 10, 9, 56, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), 'paid      ', 954, 'Tampa-St. Petersburg-Clearwater, FL', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.78.2 (KHTML, like Gecko) Version/7.0.6 Safari/537.78.2"'),
 (6, None, None, datetime.datetime(9999, 12, 26, 0, 29, 56, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), 'paid      ', 984, 'Lake Havasu City-Kingman, AZ', '"Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.125 Safari/537.36"')]

In [10]:
%sql SELECT * FROM users LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('3', 'Isaac', 'Valdez', 'M', 'free'),
 ('87', 'Dustin', 'Lee', 'M', 'free'),
 ('21', 'Preston', 'Sanders', 'M', 'free'),
 ('71', 'Ayleen', 'Wise', 'F', 'free'),
 ('54', 'Kaleb', 'Cook', 'M', 'free')]

In [11]:
%sql SELECT * FROM songs LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('SOINLJW12A8C13314C', 'City Slickers', 'AR8IEZO1187B99055E', 2008, Decimal('149.86404')),
 ('SOGDBUF12A8C140FAA', 'Intro', 'AR558FS1187FB45658', 2003, Decimal('75.67628')),
 ('SORRZGD12A6310DBC3', 'Harajuku Girls', 'ARVBRGZ1187FB4675A', 2004, Decimal('290.55955')),
 ('SONWXQJ12A8C134D94', 'The Ballad Of Sleeping Beauty', 'ARNF6401187FB57032', 1994, Decimal('305.16200')),
 ('SOFCHDR12AB01866EF', 'Living Hell', 'AREVWGE1187B9B890A', 0, Decimal('282.43546'))]

In [12]:
%sql SELECT * FROM artists LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('ARGCY1Y1187B9A4FA5', 'Gloriana', 'Nashville, TN.', '(36.16778,-86.77836)'),
 ('AR62SOJ1187FB47BB5', 'Chase & Status', '', None),
 ('ARNPAGP1241B9C7FD4', 'lextrical', '', None),
 ('ARBEBBY1187B9B43DB', 'Tom Petty', 'Gainesville, FL', None),
 ('ARDNS031187B9924F0', 'Tim Wilson', 'Georgia', '(32.67828,-83.22295)')]

In [13]:
%sql SELECT * FROM time LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(6903, 1, 2, 44, 11, 2018, 'Am I High (Feat. Malice)'),
 (6904, 1, 2, 44, 11, 2018, None),
 (6905, 1, 2, 44, 11, 2018, 'A Lack Of Color (Album Version)'),
 (6906, 1, 2, 44, 11, 2018, 'I Have A Wish'),
 (6907, 2, 2, 44, 11, 2018, 'Monster (Album Version)')]

## REMEMBER: Restart this notebook to close connection to `sparkifydb`
Each time you run the cells above, remember to restart this notebook to close the connection to your database. Otherwise, you won't be able to run your code in `create_tables.py`, `etl.py`, or `etl.ipynb` files since you can't make multiple connections to the same database (in this case, sparkifydb).